Dlubal.SteelSurfaces.StressesType
Equivalent Stresses According to

Dlubal.SteelSurfaces.StressesType.MisesHuberHencky
Von Mises, Huber, Hencky; Shape modification hypothesis

Dlubal.SteelSurfaces.StressesType.Tresca
Tresca; Maximum shear stress criterion

Dlubal.SteelSurfaces.StressesType.RankineLame
Rankine, Lamé
Maximum principal stress criterion

Dlubal.SteelSurfaces.StressesType.BachNavierVenantPoncelet
Bach, Navier, St. Venant, Poncelet; Principal strain criterion